coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_fuart.c
    FUARTx->CR &= CR_UARTEN_CLEAR;
}

/**
  * @brief  Get received data from the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval The data received from FUARTx
  */
uint32_t FUART_GetRxData(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Return received data */
    retval = FUARTx->DR & 0xFFU;

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Data: The data to be sent.
  *   The Data range is 0x00 to 0xFF.
  * @retval None
  */
void FUART_SetTxData(TSB_FUART_TypeDef * FUARTx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DATA(Data));

    FUARTx->DR = Data & 0xFFU;
}

/**
  * @brief  Get receive error status.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval The union that indicates Full UART receive error status.
  */
FUART_Err FUART_GetErrStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_Err retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Read the receive error status information from UARTDR register */
    retval.All = FUARTx->RSR;
    return retval;
}

/**
  * @brief  Clear receive error status.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_ClearErrStatus(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Clear the receive error status */
    FUARTx->ECR &= ECR_ERROR_CLEAR;
}

/**
  * @brief  Get the state that whether the specified Full UART channel
  *         is transmitting data or stopped.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval The work state of specified Full UART channel
  *   it can be one of the following values:
  *   BUSY: The Full UART is transmitting data
  *   DONE: The Full UART has stopped transmitting data
  */
WorkState FUART_GetBusyState(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;
    WorkState retval = DONE;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    tmp = FUARTx->FR & FR_BUSY_FLAG;

    /* Check busy flag */
    if (tmp == FR_BUSY_FLAG) {
        retval = BUSY;
    } else {
        /* do nothing */
    }
    return retval;

}

/**
  * @brief  Get the FIFO or hold register status.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param Direction: The direction of Full UART.
  *   This parameter can be one of the following values:
  *   FUART_RX, FUART_TX
  * @retval The storage status.
  *   When FIFO is enabled, FUART_StorageStatus indicates the FIFO status.
  *   When FIFO is disabled, FUART_StorageStatus indicates the hold register status.
  */
FUART_StorageStatus FUART_GetStorageStatus(TSB_FUART_TypeDef * FUARTx, FUART_Direction Direction)
{
    uint32_t fen = 0U;
    uint32_t src = 0U;
    FUART_StorageStatus retval = FUART_STORAGE_EMPTY;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DIRECTION(Direction));

    fen = FUARTx->LCR_H & LCR_H_FIFO_EN_FLAG;
    src = FUARTx->FR;
    if (fen == LCR_H_FIFO_EN_FLAG) {    /* FIFO mode */
        if (Direction == FUART_TX) {    /* Get Transmit FIFO status */
            src = FUARTx->FR & FR_TX_STORAGE_MASK;
            switch (src) {
            case FR_TX_STORAGE_NORMAL:
                retval = FUART_STORAGE_NORMAL;
                break;
            case FR_TX_STORAGE_FULL:
                retval = FUART_STORAGE_FULL;
                break;
            case FR_TX_STORAGE_EMPTY:
                retval = FUART_STORAGE_EMPTY;
                break;
            case FR_TX_STORAGE_INVALID:
                retval = FUART_STORAGE_INVALID;
                break;
            default:
                /* do nothing */
                break;
            }
        } else {                /* Get Receive FIFO status */
            src = FUARTx->FR & FR_RX_STORAGE_MASK;
            switch (src) {
            case FR_RX_STORAGE_NORMAL:
                retval = FUART_STORAGE_NORMAL;
                break;
            case FR_RX_STORAGE_EMPTY:
                retval = FUART_STORAGE_EMPTY;
                break;
            case FR_RX_STORAGE_FULL:
                retval = FUART_STORAGE_FULL;
                break;
            case FR_RX_STORAGE_INVALID:
                retval = FUART_STORAGE_INVALID;
                break;
            default:
                /* do nothing */
                break;
            }
        }
    } else {                    /* character mode */
        if (Direction == FUART_TX) {    /* Get Transmit hold register status */
            src = FUARTx->FR & FR_TX_STORAGE_MASK;
            switch (src) {
            case FR_TX_STORAGE_NORMAL:
            case FR_TX_STORAGE_INVALID:
                retval = FUART_STORAGE_INVALID;
                break;
            case FR_TX_STORAGE_FULL:
                retval = FUART_STORAGE_FULL;
                break;
            case FR_TX_STORAGE_EMPTY:
                retval = FUART_STORAGE_EMPTY;
                break;
            default:
                /* do nothing */
                break;
            }
        } else {                /* Get Receive hold register status */
            src = FUARTx->FR & FR_RX_STORAGE_MASK;
            switch (src) {
            case FR_RX_STORAGE_NORMAL:
            case FR_RX_STORAGE_INVALID:
                retval = FUART_STORAGE_INVALID;
                break;
            case FR_RX_STORAGE_EMPTY:
                retval = FUART_STORAGE_EMPTY;
                break;
            case FR_RX_STORAGE_FULL:
                retval = FUART_STORAGE_FULL;
                break;
            default:
                /* do nothing */
                break;
            }
        }
    }
    return retval;
}

/**
  * @brief  Set IrDA lower-power divisor.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Divisor: The IrDA Low-power divisor (from 0x01 to 0xFF)
  * @retval None
  */
void FUART_SetIrDADivisor(TSB_FUART_TypeDef * FUARTx, uint32_t Divisor)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_IRDA_DIVISOR(Divisor));

