coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_fuart.c
    FUARTx->ILPR = Divisor & 0xFFU;
}

/**
  * @brief  Initialize and configure the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  InitStruct: The structure containing basic Full UART configuration
  * @retval None
  */
void FUART_Init(TSB_FUART_TypeDef * FUARTx, FUART_InitTypeDef * InitStruct)
{
    uint32_t tmp = 0U;
    uint32_t fuartclk = 0U;
    uint32_t ibd = 0U;          /* Interger part of baud rate divisor */
    uint32_t fbd = 0U;          /* Franctional part of baud rate divisor */
    uint32_t br = InitStruct->BaudRate; /* BaudRate */
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(InitStruct));
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_BAUDRATE(InitStruct->BaudRate));
    assert_param(IS_FUART_DATA_BITS(InitStruct->DataBits));
    assert_param(IS_FUART_STOPBITS(InitStruct->StopBits));
    assert_param(IS_FUART_PARITY(InitStruct->Parity));
    assert_param(IS_FUART_MODE(InitStruct->Mode));
    assert_param(IS_FUART_FLOW_CTRL(InitStruct->FlowCtrl));

    /* Get UARTCLK */
    SystemCoreClockUpdate();
    fuartclk = SystemCoreClock; /* UARTCLK = fsys */

    ibd = fuartclk / (16U * br);
    fbd = (8U * fuartclk + br - 128U * ibd * br) / (2U * br);

    if (fbd == 0U) {
        fbd = 1U;               /* Franctional part of baud rate divisor can not be 0x00 */
    } else {
        /* do nothing */
    }

    FUARTx->IBDR = ibd;         /* Set interger part of baud rate divisor */
    FUARTx->FBDR = fbd;         /* Set franctional part of baud rate divisor */

    tmp = FUARTx->LCR_H;

    tmp &= LCR_H_WLEN_MASK;
    tmp |= InitStruct->DataBits;

    tmp &= LCR_H_STP2_MASK;
    tmp |= InitStruct->StopBits;

    tmp &= LCR_H_PARITY_MASK;
    tmp |= InitStruct->Parity;

    FUARTx->LCR_H = tmp;        /* Set DataBits, StopBits, Parity */

    tmp &= CR_FLOW_CTRL_MASK;
    tmp |= InitStruct->FlowCtrl;

    tmp &= CR_MODE_MASK;
    tmp |= InitStruct->Mode;

    FUARTx->CR = tmp;           /* Set Flow Control, Mode */
}

/**
  * @brief  Enable the transmit and receive FIFO.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_EnableFIFO(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    FUARTx->LCR_H |= LCR_H_FIFO_EN_SET;
}

/**
  * @brief  Disable the transmit and receive FIFO and the mode will be changed to character mode.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_DisableFIFO(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    FUARTx->LCR_H &= LCR_H_FIFO_EN_CLEAR;
}

/**
  * @brief  Generate the break condition for Full UART.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  NewState: New state of the FUART Send break.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetSendBreak(TSB_FUART_TypeDef * FUARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set UARTxLCR_H<BRK> to  enable the send break to generate transmit break condition */
        FUARTx->LCR_H |= LCR_H_BRK_SET;
    } else {
        /* Clear UARTxLCR_H<BRK> to disable the send break */
        FUARTx->LCR_H &= LCR_H_BRK_CLEAR;
    }
}

/**
  * @brief  Select IrDA encoding mode for transmitting 0 bits.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @param  Mode: IrDA encoding mode select for transmitting 0 bits.
  *   This parameter can be one of the following values:
  *   FUART_IRDA_3_16_BIT_PERIOD_MODE
  *   FUART_IRDA_3_TIMES_IRLPBAUD16_MODE  
  * @retval None
  */
void FUART_SetIrDAEncodeMode(TSB_FUART_TypeDef * FUARTx, uint32_t Mode)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_IRDA_ENCODE_MODE(Mode));

    /* read UARTCR register then clear bit<SIRLP> as FUART_IRDA_3_16_BIT_PERIOD_MODE */
    tmp = FUARTx->CR & CR_SIRLP_MASK;

    if (Mode == FUART_IRDA_3_TIMES_IRLPBAUD16_MODE) {
        /* Set mode as FUART_IRDA_3_TIMES_IRLPBAUD16_MODE */
        tmp |= FUART_IRDA_3_TIMES_IRLPBAUD16_MODE;
    } else {
        /* do nothing */
    }

    tmp &= CR_WRITE0_BIT_MASK;  /* UARTCR bit 7 write as zero */
    FUARTx->CR = tmp;
}

/**
  * @brief  Enable the IrDA circuit
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval The result of enabling IrDA circuit
  *   This parameter can be one of the following values:
  *   SUCCESS: Enable IrDA circuit successfully.
  *   ERROR: The UART channel is disabled, can not enable IrDA circuit.
  */
Result FUART_EnableIrDA(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;
    Result retval = SUCCESS;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Get UARTCR<UARTEN> to check if Full UART channel is enabled */
    tmp = FUARTx->CR & CR_UARTEN_MASK;

    if (tmp == CR_UARTEN_SET) { /* Full UART is enabled */
        tmp = FUARTx->CR | CR_SIREN_SET;
        tmp &= CR_WRITE0_BIT_MASK;      /* UARTCR bit 7 write as zero */
        FUARTx->CR = tmp;
    } else {                    /* Full UART is disabled */
        retval = ERROR;         /* Can not enable IrDA circuit */
    }

    return retval;
}

/**
  * @brief  Disable the IrDA circuit
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART4, FUART5.
  * @retval None
  */
void FUART_DisableIrDA(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

